config/extra.org
#+title persemacs-extra
#+author: Erwann Rogard
#+property: header-args :tangle no

#+name: doc-lead
#+begin_src org
  This is a standalone Emacs Org file containing emacs-lisp functionality.
#+end_src

* doc
** license
:PROPERTIES:
:custom_id: _doc-license
:END:

#+name: doc-license
#+begin_src emacs-lisp
  ;;  persemacs-extra — extra elisp functionality
  ;;  Copyright (C) 2024 — Erwann Rogard
  ;;  Released under GPL 3.0
  ;;  See https://www.gnu.org/licenses/gpl-3.0.en.html
#+end_src

** requirement
:PROPERTIES:
:custom_id: _doc-req
:END:

*** machine
:PROPERTIES:
:custom_id: _doc-req-machine
:END:

Installed:
#+name: doc-install
| Emacs |

** workflow

For each source blocks below:
- Execute it
- Process the matches as indicated

#+begin_src emacs-lisp
  (org-occur "header-args: :tangle" nil nil)
#+end_src

** reference

Emacs-org:
- [[https://orgmode.org/manual/Working-with-Source-Code.html][Working with source code]]

* source
** org
*** table

#+name: tbl-foo-bar-string
| "foo" | "x" |
| "bar" | "y" |

#+name: tbl-foo-bar-dir
| "foo" | "./foo" |
| "bar" | "./bar" |

*** src

#+name: foo-bar
#+begin_src json
  { "key" : "X" }
#+end_src

#+name: foo-qux
#+begin_src json
  { "key" : "Y" }
#+end_src

** el
*** group

#+header: :noweb-ref source-elisp
#+begin_src emacs-lisp
    (defgroup erw/extra nil "erw's extra elisp functionality"
      :prefix "erw/")
#+end_src

*** string
**** wrap-single-quotes

#+header: :noweb-ref source-elisp
#+begin_src emacs-lisp
  (defun erw/function-string-wrap-single-quotes (filename)
    "Wraps STRING with single quotes if absent."
    (if (string-match-p "^'.*'$" filename)
       string
      (concat "'" filename "'")))
  (defalias 'erw/wrap-single-quotes 'erw/function-string-wrap-single-quotes)
#+end_src

#+RESULTS:
: erw/wrap-single-quotes

#+header: :noweb-ref elisp-example
#+begin_src emacs-lisp
  (let ((string (buffer-file-name (current-buffer))))
    (format "before: %s\nafter: %s" string 
             (funcall 'erw/wrap-single-quotes string)))
#+end_src

#+RESULTS:
: before: /home/erwann/.emacs.d/routinel.org
: after: '/home/erwann/.emacs.d/routinel.org'

*** table
**** field-address

#+header: :noweb-ref source-elisp
#+begin_src emacs-lisp
  (defun erw/function-table-field-address (index)
    "Table address for field INDEX"
    (format "@1$%d..@>$%d" index index))
  (defalias 'erw/field-address 'erw/function-table-field-address)
#+end_src

#+RESULTS:
: erw/field-address

#+header: :noweb-ref elisp-example
#+begin_src emacs-lisp
  (erw/field-address 2)
#+end_src

#+RESULTS:
: @1$2..@>$2

**** get-range

#+header: :noweb-ref source-elisp
#+begin_src emacs-lisp
  (defun erw/function-table-get-range-at-file (tbl-id range-address &optional file-name)
    "Get list of values in RANGE-ADDRESS from TBL-ID at FILE-NAME.
       Credits: https://redd.it/r2nig7"
    (let ((file-name (or file-name (buffer-file-name (current-buffer)))))
      (with-current-buffer (find-file-noselect file-name)
        (let ((result-with-properties
               (org-table-get-remote-range tbl-id range-address)))
          (mapcar (lambda (s)
                    (substring-no-properties (substring s 1 -1)))
                  result-with-properties)))))
  (defalias 'erw/table-range 'erw/function-table-get-range-at-file)
#+end_src

#+RESULTS:
: erw/table-range

#+header: :noweb-ref elisp-example
#+header: :results value verbatim
#+begin_src emacs-lisp
(erw/table-range "tbl-foo-bar-string" (format "@1$%d..@>$%d" 2 2))
#+end_src

#+RESULTS:
: ("x" "y")

**** lookup

#+header: :noweb-ref source-elisp
#+begin_src emacs-lisp
    (defun erw/function-table-lookup (tbl-id key &optional file-name key-index value-index match-predicate)
      "Lookup field KEY-INDEX and return corresponding entry in field VALUE-INDEX from table TBL-ID."
      (interactive)
      (let ((key-address (erw/field-address (or key-index 1)))
            (value-address (erw/field-address (or value-index 2)))
            (file-name (or file-name (buffer-file-name (current-buffer))))
            (match-predicate (or match-predicate 'string-match-p)))
        (let ((key-range (erw/table-range tbl-id key-address file-name))
              (value-range (erw/table-range tbl-id value-address file-name)))
          (org-lookup-first key key-range value-range 'string-match-p))))
  (defalias 'erw/table-lookup 'erw/function-table-lookup)
#+end_src

#+RESULTS:
: erw/table-lookup

#+header: :noweb-ref elisp-example
#+begin_src emacs-lisp
(erw/table-lookup "tbl-foo-bar-string" "foo")
#+end_src

#+RESULTS:
: x

#+header: :noweb-ref elisp-example
#+begin_src emacs-lisp
(erw/table-lookup "tbl-foo-bar-string" "bar")
#+end_src

#+RESULTS:
: y

*** element

#+header: :noweb-ref source-elisp
#+begin_src emacs-lisp
  (defun erw/function-filter-elements (type regex)
    "Filter elements of the given TYPE from the current Org buffer by matching their name with REGEX."
    (let* ((parsed-buffer (org-element-parse-buffer))
           (elements (org-element-map parsed-buffer type 
                                    (lambda (elem) (org-element-property :name elem)))))
           (-filter (lambda (elem) (string-match-p regex elem)) elements)))
  (defalias 'erw/filter-elements 'erw/function-filter-elements)
#+end_src

#+header: :noweb-ref source-elisp
#+begin_src emacs-lisp
  (defun erw/filter-block-names (regex &optional file)
    "Filter the source block names using REGEX in FILE."
    (let ((block-names (reverse (org-babel-src-block-names file))))
      (cl-remove-if-not (lambda (block) (string-match-p regex block)) block-names)))
#+end_src

*** noweb

#+header: :noweb-ref source-elisp
#+begin_src emacs-lisp
  (defun erw/noweb-expand (name)
    "Expands block NAME"
    (let* ((block (org-babel-find-named-block name))
  	 (info (when block
  		 (save-excursion
                     (goto-char block)
                     (org-babel-get-src-block-info t)))))
      (when info
        (org-babel-expand-noweb-references info))))
#+end_src

#+header: :noweb-ref source-elisp
#+begin_src emacs-lisp
  (defun __erw/noweb-concat-rest (separator &rest names)
    "Concatenate the blocks NAMEs using SEPARATOR"
    (mapconcat #'erw/noweb-expand names separator))
  (defun __erw/noweb-concat-list (separator &optional names)
    "Concatenate the blocks NAMEs using SEPARATOR"
    (apply #'__erw/noweb-concat-rest separator names))
  (defun erw/noweb-concat (separator &rest names)
    "Concatenate the blocks NAMEs using SEPARATOR."
    (if (and names
             (listp (car names))
             (null (cdr names)))
        (__erw/noweb-concat-list separator (car names))
      (__erw/noweb-concat-rest separator names)))
#+end_src

#+header: :noweb-ref elisp-example
#+begin_src emacs-lisp
  (format "{%s}" (erw/noweb-concat ", " (erw/filter-block-names "foo[a-z]*")))
#+end_src

#+RESULTS:
: {{ "key" : "Y" }, { "key" : "X" }}

* tangle
** extra
:PROPERTIES:
:header-args: :tangle ./extra.el
:END:

#+header: :noweb yes
#+begin_src emacs-lisp
  <<doc-license>>
  <<source-elisp>>
#+end_src

#+RESULTS:
: erw/noweb-concat

* miscellany
** trash
*** path
**** from-table

#+header: :noweb-ref source-elisp-disable
#+begin_src emacs-lisp
    (defun erw/function-path-from-table (tbl-name key &optional child)
      (let* ((parent (erw/table-lookup tbl-name key)))
	   (parent "./foo/"))
           (if child
                     (expand-file-name child (file-name-as-directory parent))
                   (expand-file-name parent))))
  (defalias 'erw/path-from-table 'erw/function-path-from-table)
#+end_src

#+RESULTS:
: erw/path-from-table

#+header: :noweb-ref elisp-example
#+header: :results value
#+begin_src emacs-lisp
(erw/path-from-table "tbl-foo-bar-dir" "foo")
#+end_src

#+RESULTS:
: /home/erwann/github/rogard/persemacs/.emacs.d/foo/

#+header: :noweb-ref elisp-example
#+header: :results value
#+begin_src emacs-lisp
(erw/path-from-table "tbl-foo-bar-dir" "foo" "bar")
#+end_src

#+RESULTS:
: /home/erwann/github/rogard/persemacs/.emacs.d/foo/bar

*** ensure-directory

Redundant with file-name-as-directory

#+header: :noweb-ref source-elisp-disable
#+begin_src emacs-lisp
  (defun erw/ensure-directory (path)
    "Ensures PATH ends with a slash"
    (if (not (string-match-p "/$" path))
        (concat path "/")
      path))
#+end_src

#+RESULTS:
: erw/ensure-directory

#+header: :noweb-ref elisp-example
#+begin_src emacs-lisp
(erw/ensure-directory "foo")
#+end_src

#+RESULTS:
: foo/

*** jtable-range

#+header: :noweb-ref debug
#+begin_src emacs-lisp
(defun j/remote-table-range (path name range)
  (with-current-buffer (find-file-noselect path)
  (org-table-get-remote-range name range)))
#+end_src

#+RESULTS:
: j/remote-table-range

#+name: tbl-foo-bar-string
| "foo" | "x" |
| "bar" | "y" |

#+header: :noweb-ref debug
#+header: :results value verbatim
#+begin_src emacs-lisp
(j/remote-table-range (buffer-file-name) "tbl-foo-bar-string" (format "@1$%d..@>$%d" 2 2))
#+end_src

#+RESULTS:
: (#("\"x\"" 0 3 (wrap-prefix #("      " 0 6 (face org-indent)) line-prefix #("      " 0 6 (face org-indent)) face org-table fontified t)) #("\"y\"" 0 3 (wrap-prefix #("      " 0 6 (face org-indent)) line-prefix #("      " 0 6 (face org-indent)) face org-table fontified t)))

#+header: :results verbatim
#+begin_src emacs-lisp
  (let ((result  #("\"x\"" 0 3 (wrap-prefix #("      " 0 6 (face org-indent)) line-prefix #("      " 0 6 (face org-indent)) face org-table fontified t))))
  (substring-no-properties result))
#+end_src

#+RESULTS:
: "\"x\""

#+header: :results verbatim
#+begin_src emacs-lisp
  (let ((result-with-properties  #("\"x\"" 0 3 (wrap-prefix #("      " 0 6 (face org-indent)) line-prefix #("      " 0 6 (face org-indent)) face org-table fontified t))))
  (substring-no-properties (substring result 1 -1)))
#+end_src

#+RESULTS:
: "x"

** scratchpad
*** tangle
:PROPERTIES:
:header-args: :tangle (erw/table-to-path "tbl-foo-bar-dir" "foo" "test.el")
:END:

#+begin_src emacs-lisp
  (message "testing %s" "foo")
#+end_src

*** table

#+begin_src emacs-lisp
  (org-table-get-remote-range "const-path" "@1$1..@>$1")
#+end_src

#+RESULTS:
: unique-directory

#+header: :results value
#+begin_src emacs-lisp
   (org-table-get-remote-range "foobar" (format "@1$%d..@>$%d" 1 1))
#+end_src

#+RESULTS:
| foo | bar |

#+header: :results value
#+begin_src emacs-lisp
   (org-table-get-remote-range "file:/home/erwann/.emacs.d/config.org::foobar" (format "@1$%d..@>$%d" 1 1))
#+end_src


#+begin_src emacs-lisp
  (org-lookup-first "unique-directory"
                    (erw/function-table-get-field "const-path" 1)
                    (erw/function-table-get-field "const-path" 2)))
#+end_src

#+RESULTS:
: "/home/erwann/unique"

*** list

#+header: example-plist-get-1
#+begin_src emacs-lisp
  (let ((my-listp (list 'foo "x" 'bar "y")))
    (plist-get my-listp 'foo))
#+end_src

#+RESULTS:
: x

#+header: example-plist-get-2
#+begin_src emacs-lisp
  (let ((my-listp '("foo" "x" bar "y")))
    (list (plist-get my-listp 'bar 'eq)
     (plist-get my-listp "foo" 'string-match-p)))
#+end_src

#+RESULTS:
| y | x |

#+name: debug-a
#+begin_src emacs-lisp
  (let ((my-alist '(("foo" . "x")
                 ("bar" . "y"))))
      (cdr (assoc "foo" my-alist)))
#+end_src

#+RESULTS: debug-a
: x

#+name: debug-b
#+begin_src emacs-lisp
  (makunbound 'my-pair)
  (makunbound 'my-pair-x)
  (makunbound 'my-pair-y)
  (defun my-pair (key value)
    (cons key value))
  (defun my-pair-x (key)
    (my-pair key "x"))
  (defun my-pair-y (key)
    (my-pair key "y"))
  (let ((my-alist `(,(my-pair-x "foo")
                    , (my-pair-y "bar"))))
    (cdr (assoc "foo" my-alist)))
#+end_src

#+RESULTS: debug-b
: ((foo . x) (bar . y))

#+begin_src emacs-lisp
      (defconst my-alist '(("us-ascii" . "text")
                     ("utf-8" . "text")
       ("utf-16" . "text")
       ("utf-32" . "text")
       ("iso-8859-1" . "text")
       ("iso-8859-2" . "text")
       ("iso-8859-15" . "text")
       ("windows-1252" . "text")
       ("euc-jp" . "text")
       ("shift_jis" . "text")
       ("euc-kr" . "text")
       ("big5" . "text")
       ("gb2312" . "text")
       ("binary" . "binary")))
      (alist-get "big5" my-alist nil nil 'equal)
;;      (cdr (assoc "big5" my-alist)))
#+end_src

#+RESULTS:
: text

#+name: setup-1
#+begin_src emacs-lisp
  (defun my-fun () (message "%s" "foo"))
  (defvar my-var (my-fun))
  (symbol-value 'my-var)
#+end_src

#+RESULTS:
: foo

#+name: setup-2
#+begin_src emacs-lisp
(makunbound my-var)
(makunbound my-fun)
  (defvar my-var (my-fun))
  (defun my-fun () (message "%s" "foo"))
  (symbol-value 'my-var)
#+end_src

